artillery-tests/create-questions.yml
config:
  # target: "TYPE HERE THE DEPLOYED TARGET"
  target: "http://localhost:8080/scc2223-proj1-1.0/rest"
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
    metricsProcessEndpoint: "myProcessEndpoint" # function used to aggregate endpoints for statistics
  phases:
    - name: "Create questions" # Create questions
      duration: 1
      arrivalCount: 1

scenarios:
  - name: "Create questions"
    weight: 1
    flow:
      - loop:
          - function: "selectUserToAskQuestion" # Select user to ask question
          - post:
              url: "/user/auth"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                id: "{{ userNickname }}"
                pwd: "{{ userPwd }}"
              capture:
                header: "set-cookie"
                as: "cookie"
            # log the cookie
          - log: "this is the cookie: {{ cookie[0] }}"
          - post:
              url: "/auction/{{auctionId}}/question"
              headers:
                Content-Type: application/json
                Accept: application/json
                Cookie: "{{ cookie[0] }}"
              json:
                userNickname: "{{ userNickname }}"
                message: "{{ question }}"
              capture:
                json: "$.id"
                as: "questionId"
              afterResponse: "processNewQuestionReply" # capture result and store in file
              expect:
                - statusCode: 200
          - function: "selectOwnerToReply" # Select owner to reply to question
          - post:
              url: "/user/auth"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                id: "{{ ownerNickname }}"
                pwd: "{{ ownerPwd }}"
              capture:
                header: "set-cookie"
                as: "cookieOwner"
            # log the cookie
          - log: "this is the cookie: {{ cookieOwner[0] }}"
          - post:
              url: "/auction/{{auctionId}}/question/"
              headers:
                Content-Type: application/json
                Accept: application/json
                Cookie: "{{ cookieOwner[0] }}"
              json:
                userNickname: "{{ ownerNickname }}"
                reply: "{{ reply }}"
                message: "{{ replyMessage }}"
                questionId: "{{ questionId }}"
              afterResponse: "processNewQuestionReply" # capture result and store in file
              expect:
                - statusCode: 200
        count: 5 # number of questions to create